## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 3 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies"  {
      ~ id      = "4031368330" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-production-file-queue/*",
                          - "arn:aws:s3:::scan-files-production-file-queue",
                          - "arn:aws:s3:::scan-files-production-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-production-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:806545929748:parameter/scan-files/api_auth_token",
                          - "arn:aws:ssm:ca-central-1:806545929748:parameter/ENVIRONMENT_VARIABLES",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ssm:ca-central-1:806545929748:parameter/scan-files/api_auth_token",
                # (1 unchanged element hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          ~ actions       = [
              - "lambda:InvokeFunction",
              + "secretsmanager:GetSecretValue",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api",
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api",
            ]
        }
    }

  # aws_kms_key.scan-files will be updated in-place
  ~ resource "aws_kms_key" "scan-files" {
        id                                 = "c71bf0dd-721d-4f36-be85-5bea7927ad43"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ policy                             = (sensitive)
        tags                               = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.api_auth_token will be created
  + resource "aws_secretsmanager_secret" "api_auth_token" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = "arn:aws:kms:ca-central-1:806545929748:key/c71bf0dd-721d-4f36-be85-5bea7927ad43"
      + name                           = "/scan-files/api_auth_token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags                           = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_policy.api_auth_token will be created
  + resource "aws_secretsmanager_secret_policy" "api_auth_token" {
      + id         = (known after apply)
      + policy     = (sensitive)
      + secret_arn = (known after apply)
    }

  # aws_secretsmanager_secret_version.api_auth_token will be created
  + resource "aws_secretsmanager_secret_version" "api_auth_token" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_ssm_parameter.api_auth_token will be destroyed
  - resource "aws_ssm_parameter" "api_auth_token" {
      - allowed_pattern = "" -> null
      - arn             = "arn:aws:ssm:ca-central-1:806545929748:parameter/scan-files/api_auth_token" -> null
      - data_type       = "text" -> null
      - description     = "" -> null
      - id              = "/scan-files/api_auth_token" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/scan-files/api_auth_token" -> null
      - tags            = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value)
      - version         = 3 -> null
    }

  # module.api.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::806545929748:policy/scan-files-api-0"
        name      = "scan-files-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-production-file-queue/*",
                          - "arn:aws:s3:::scan-files-production-file-queue",
                          - "arn:aws:s3:::scan-files-production-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-production-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:806545929748:parameter/scan-files/api_auth_token",
                          - "arn:aws:ssm:ca-central-1:806545929748:parameter/ENVIRONMENT_VARIABLES",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - handler                        = "" -> null
        id                             = "scan-files-api"
      - kms_key_arn                    = "" -> null
      - runtime                        = "" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "API_AUTH_TOKEN_SSM_NAME" = "/scan-files/api_auth_token"
              - "FILE_QUEUE_BUCKET"       = "scan-files-production-file-queue"
              - "SQLALCHEMY_DATABASE_URI" = (sensitive)
            } -> (known after apply)
        }



        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
